In [ ]:
# Programmer : Srushti Garad
# College : Keystone School Of Engineering
# Class : TE (A)
# Roll No :  20

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student.csv')

In [3]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [4]:
# Slicing-Index Based

In [17]:
df.iloc[4:9,1:4]

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75

In [11]:
 df.iloc[:9,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [12]:
df.iloc[4:,1:4]

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75
9   anmol    BE  78.66

In [13]:
 df.iloc[:,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [14]:
 df.iloc[4:9,:4]

   roll    name class  marks
4     5    asha    TE  63.28
5     6  ayesha    BE  49.55
6     7    amar    BE  65.34
7     8   amita    BE  68.33
8     9    amol    TE  56.75

In [15]:
 df.iloc[4:9,1:]

     name class  marks  age
4    asha    TE  63.28   20
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23
8    amol    TE  56.75   20

In [16]:
 df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [19]:
x = df.iloc[4:9]

In [20]:
type (x)

pandas.core.frame.DataFrame

In [21]:
df.iloc[[5,7,2,1], : ]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
7     8   amita    BE  68.33   23
2     3  aniket    BE  76.88   19
1     2    amit    TE  59.77   21

In [22]:
df.iloc[[5,7,2,1], [1,3] ]

     name  marks
5  ayesha  49.55
7   amita  68.33
2  aniket  76.88
1    amit  59.77

In [23]:
df.loc[5, : ]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [24]:
df.loc[5]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [25]:
df.iloc[ : ,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [29]:
df.iloc[3,1]

'ajinkya'

In [30]:
#### Slicing - Label Based

In [32]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [35]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [36]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [37]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [38]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [39]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [43]:
# for removing row 5 ->

df.iloc[list(range(5))+list(range(6,10))]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [44]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [50]:
# 5 is not included
list(range(5)) + list(range(6,10))

[0, 1, 2, 3, 4, 6, 7, 8, 9]

In [51]:
# only for dropping rows
df.drop([5,8,2])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [52]:
# dropping columns
df.drop ('class', axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [55]:
df.drop (['class','age'], axis=1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [60]:
##### Functions / Methods

In [61]:
df['marks'].mean()

64.499

In [62]:
df['marks'].max()

78.66

In [63]:
df['marks'].min()

49.55

In [64]:
df['marks'].sum()

644.9899999999999

In [74]:
# value which come at centre is median
df['marks'].median()

64.31

In [81]:
##### average distance of every point from mean is -> Standard Deviation

df['marks'].std()

9.207178901994535

In [75]:
### descriptive statistics -> what is happen in the past

In [76]:
df['name'].min()

'ajinkya'

In [77]:
df['name'].max()

'ayesha'

In [78]:
# we cannot perform mean of string

In [79]:
df['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [ ]:
## Qualitative data  -> (string data ) Types: 1) Nominal data -> string data (Non-order) e.g-name  (2) Ordinal data -> string data which can we order them(sort them) e.g - class (TE,FE,SE)
## Quantitative data -> (data which can be used in arithmatic) -> Types : 1) Discrete -> full number which cannot be floatingpont num (e.g roll no -20 )  2) Continous data -> which contain decimal points (e.g height 5.5)
## Categorical data -> fixed categories present ->  Ordinal /Discrete

In [83]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [84]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [ ]:
## mode -> most frequently appeared data (maximumly appeared num or data)  ->used for  Discrete or Nominal

In [88]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [89]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [90]:
df['class'].count()

10

In [91]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [95]:
df.mean(numeric_only = True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [96]:
df.std(numeric_only = True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [98]:
# for rows
df.mean(numeric_only = True , axis=1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [101]:
# by default numeric data
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [ ]:
#50%  ->  median or centre
#25%  ->  first half / upper half
#75%  ->  second half / Lower half